tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1509_tdd.h
#define PWM1DCH2                      522
#define PWM1DCH3                      523
#define PWM1DCH4                      524
#define PWM1DCH5                      525
#define PWM1DCH6                      526
#define PWM1DCH7                      527
#define PWM1CON                       528
#define PWM1POL                       529
#define PWM1OUT                       530
#define PWM1OE                        531
#define PWM1EN                        532
#define PWM2DCL0                      533
#define PWM2DCL                       534
#define PWM2DCL1                      535
#define PWM2DCH0                      536
#define PWM2DCH                       537
#define PWM2DCH1                      538
#define PWM2DCH2                      539
#define PWM2DCH3                      540
#define PWM2DCH4                      541
#define PWM2DCH5                      542
#define PWM2DCH6                      543
#define PWM2DCH7                      544
#define PWM2CON                       545
#define PWM2POL                       546
#define PWM2OUT                       547
#define PWM2OE                        548
#define PWM2EN                        549
#define PWM3DCL0                      550
#define PWM3DCL                       551
#define PWM3DCL1                      552
#define PWM3DCH0                      553
#define PWM3DCH                       554
#define PWM3DCH1                      555
#define PWM3DCH2                      556
#define PWM3DCH3                      557
#define PWM3DCH4                      558
#define PWM3DCH5                      559
#define PWM3DCH6                      560
#define PWM3DCH7                      561
#define PWM3CON                       562
#define PWM3POL                       563
#define PWM3OUT                       564
#define PWM3OE                        565
#define PWM3EN                        566
#define PWM4DCL                       567
#define PWM4DCL0                      568
#define PWM4DCL1                      569
#define PWM4DCH0                      570
#define PWM4DCH                       571
#define PWM4DCH1                      572
#define PWM4DCH2                      573
#define PWM4DCH3                      574
#define PWM4DCH4                      575
#define PWM4DCH5                      576
#define PWM4DCH6                      577
#define PWM4DCH7                      578
#define PWM4CON                       579
#define PWM4POL                       580
#define PWM4OUT                       581
#define PWM4OE                        582
#define PWM4EN                        583
#define CWG1DBR0                      584
#define CWG1DBR                       585
#define CWG1DBR1                      586
#define CWG1DBR2                      587
#define CWG1DBR3                      588
#define CWG1DBR4                      589
#define CWG1DBR5                      590
#define CWG1DBF                       591
#define CWG1DBF0                      592
#define CWG1DBF1                      593
#define CWG1DBF2                      594
#define CWG1DBF3                      595
#define CWG1DBF4                      596
#define CWG1DBF5                      597
#define CWG1CON0                      598
#define G1CS0                         599
#define G1CS                          600
#define G1POLA                        601
#define G1POLB                        602
#define G1OEA                         603
#define G1OEB                         604
#define G1EN                          605
#define CWG1CON1                      606
#define G1IS0                         607
#define G1IS                          608
#define G1IS1                         609
#define G1IS2                         610
#define G1ASDLA                       611
#define G1ASDLA0                      612
#define G1ASDLA1                      613
#define G1ASDLB                       614
#define G1ASDLB0                      615
#define G1ASDLB1                      616
#define CWG1CON2                      617
#define G1ASDSCLC2                    618
#define G1ASDSFLT                     619
#define G1ASDSC1                      620
#define G1ASDSC2                      621
#define G1ARSEN                       622
#define G1ASE                         623
#define CLCDATA                       624
#define MCLC1OUT                      625
#define MCLC2OUT                      626
#define MCLC3OUT                      627
#define MCLC4OUT                      628
#define CLC1CON                       629
#define LC1MODE0                      630
#define LC1MODE                       631
#define CLC1CON_LCMODE0               632
#define LC1MODE1                      633
#define CLC1CON_LCMODE1               634
#define CLC1CON_LCMODE2               635
#define LC1MODE2                      636
#define LC1INTN                       637
#define CLC1CON_LCINTN                638
#define LC1INTP                       639
#define CLC1CON_LCINTP                640
#define CLC1CON_LCOUT                 641
#define LC1OUT                        642
#define LC1OE                         643
#define CLC1CON_LCOE                  644
#define LC1EN                         645
#define CLC1CON_LCEN                  646
#define CLC1POL                       647
#define LC1G1POL                      648
#define CLC1POL_G1POL                 649
#define CLC1POL_G2POL                 650
#define LC1G2POL                      651
#define LC1G3POL                      652
#define CLC1POL_G3POL                 653
#define LC1G4POL                      654
#define CLC1POL_G4POL                 655
#define CLC1POL_POL                   656
#define LC1POL                        657
#define CLC1SEL0                      658
#define LC1D1S                        659
#define CLC1SEL0_D1S0                 660
#define LC1D1S0                       661
#define CLC1SEL0_D1S1                 662
#define LC1D1S1                       663
#define CLC1SEL0_D1S2                 664
#define LC1D1S2                       665
#define LC1D2S                        666
#define LC1D2S0                       667
#define CLC1SEL0_D2S0                 668
#define LC1D2S1                       669
#define CLC1SEL0_D2S1                 670
#define LC1D2S2                       671
#define CLC1SEL0_D2S2                 672
#define CLC1SEL1                      673
#define LC1D3S0                       674
#define CLC1SEL1_D3S0                 675
#define LC1D3S                        676
#define LC1D3S1                       677
#define CLC1SEL1_D3S1                 678
#define LC1D3S2                       679
#define CLC1SEL1_D3S2                 680
#define LC1D4S                        681
#define LC1D4S0                       682
#define CLC1SEL1_D4S0                 683
#define LC1D4S1                       684
#define CLC1SEL1_D4S1                 685
#define LC1D4S2                       686
#define CLC1SEL1_D4S2                 687
#define CLC1GLS0                      688
#define CLC1GLS0_D1N                  689
#define LC1G1D1N                      690
#define CLC1GLS0_D1T                  691
#define LC1G1D1T                      692
#define LC1G1D2N                      693
#define CLC1GLS0_D2N                  694
#define LC1G1D2T                      695
#define CLC1GLS0_D2T                  696
#define CLC1GLS0_D3N                  697
#define LC1G1D3N                      698
#define CLC1GLS0_D3T                  699
#define LC1G1D3T                      700
#define CLC1GLS0_D4N                  701
#define LC1G1D4N                      702
#define CLC1GLS0_D4T                  703
#define LC1G1D4T                      704
#define CLC1GLS1                      705
#define CLC1GLS1_D1N                  706
#define LC1G2D1N                      707
#define LC1G2D1T                      708
#define CLC1GLS1_D1T                  709
#define CLC1GLS1_D2N                  710
#define LC1G2D2N                      711
#define LC1G2D2T                      712
#define CLC1GLS1_D2T                  713
#define CLC1GLS1_D3N                  714
#define LC1G2D3N                      715
#define LC1G2D3T                      716
#define CLC1GLS1_D3T                  717
#define CLC1GLS1_D4N                  718
#define LC1G2D4N                      719
#define LC1G2D4T                      720
#define CLC1GLS1_D4T                  721
#define CLC1GLS2                      722
#define CLC1GLS2_D1N                  723
#define LC1G3D1N                      724
#define LC1G3D1T                      725
#define CLC1GLS2_D1T                  726
#define LC1G3D2N                      727
#define CLC1GLS2_D2N                  728
#define LC1G3D2T                      729
#define CLC1GLS2_D2T                  730
#define CLC1GLS2_D3N                  731
#define LC1G3D3N                      732
#define LC1G3D3T                      733
#define CLC1GLS2_D3T                  734
#define LC1G3D4N                      735
#define CLC1GLS2_D4N                  736
#define LC1G3D4T                      737
#define CLC1GLS2_D4T                  738
#define CLC1GLS3                      739
#define LC1G4D1N                      740
#define CLC1GLS3_G4D1N                741
#define LC1G4D1T                      742
#define CLC1GLS3_G4D1T                743
#define CLC1GLS3_G4D2N                744
#define LC1G4D2N                      745
#define CLC1GLS3_G4D2T                746
#define LC1G4D2T                      747
#define LC1G4D3N                      748
#define CLC1GLS3_G4D3N                749
#define LC1G4D3T                      750
#define CLC1GLS3_G4D3T                751
#define CLC1GLS3_G4D4N                752
#define LC1G4D4N                      753
#define CLC1GLS3_G4D4T                754
#define LC1G4D4T                      755
#define CLC2CON                       756
#define LC2MODE0                      757
#define LC2MODE                       758
#define CLC2CON_LCMODE0               759
#define LC2MODE1                      760
#define CLC2CON_LCMODE1               761
#define LC2MODE2                      762
#define CLC2CON_LCMODE2               763
#define LC2INTN                       764
#define CLC2CON_LCINTN                765
#define LC2INTP                       766
#define CLC2CON_LCINTP                767
#define CLC2CON_LCOUT                 768
#define LC2OUT                        769
#define LC2OE                         770
#define CLC2CON_LCOE                  771
#define CLC2CON_LCEN                  772
#define LC2EN                         773
#define CLC2POL                       774
#define LC2G1POL                      775
#define CLC2POL_G1POL                 776
#define LC2G2POL                      777
#define CLC2POL_G2POL                 778
#define LC2G3POL                      779
#define CLC2POL_G3POL                 780
#define LC2G4POL                      781
#define CLC2POL_G4POL                 782
#define CLC2POL_POL                   783
#define LC2POL                        784
#define CLC2SEL0                      785
#define LC2D1S0                       786
#define CLC2SEL0_D1S0                 787
#define LC2D1S                        788
#define LC2D1S1                       789
#define CLC2SEL0_D1S1                 790
#define LC2D1S2                       791
#define CLC2SEL0_D1S2                 792
#define LC2D2S0                       793
#define LC2D2S                        794
#define CLC2SEL0_D2S0                 795
#define LC2D2S1                       796
#define CLC2SEL0_D2S1                 797
#define LC2D2S2                       798
#define CLC2SEL0_D2S2                 799
#define CLC2SEL1                      800
#define CLC2SEL1_D3S0                 801
#define LC2D3S0                       802
#define LC2D3S                        803
#define LC2D3S1                       804
#define CLC2SEL1_D3S1                 805
#define LC2D3S2                       806
#define CLC2SEL1_D3S2                 807
#define LC2D4S                        808
#define LC2D4S0                       809
#define CLC2SEL1_D4S0                 810
#define LC2D4S1                       811
#define CLC2SEL1_D4S1                 812
#define LC2D4S2                       813
#define CLC2SEL1_D4S2                 814
#define CLC2GLS0                      815
#define LC2G1D1N                      816
#define CLC2GLS0_D1N                  817
#define CLC2GLS0_D1T                  818
#define LC2G1D1T                      819
#define LC2G1D2N                      820
#define CLC2GLS0_D2N                  821
#define CLC2GLS0_D2T                  822
#define LC2G1D2T                      823
#define LC2G1D3N                      824
#define CLC2GLS0_D3N                  825
#define CLC2GLS0_D3T                  826
#define LC2G1D3T                      827
#define LC2G1D4N                      828
#define CLC2GLS0_D4N                  829
#define CLC2GLS0_D4T                  830
#define LC2G1D4T                      831
#define CLC2GLS1                      832
#define CLC2GLS1_D1N                  833
#define LC2G2D1N                      834
#define CLC2GLS1_D1T                  835
#define LC2G2D1T                      836
#define CLC2GLS1_D2N                  837
#define LC2G2D2N                      838
#define CLC2GLS1_D2T                  839
#define LC2G2D2T                      840
#define LC2G2D3N                      841
#define CLC2GLS1_D3N                  842
#define LC2G2D3T                      843
#define CLC2GLS1_D3T                  844
#define LC2G2D4N                      845
#define CLC2GLS1_D4N                  846
#define LC2G2D4T                      847
#define CLC2GLS1_D4T                  848
#define CLC2GLS2                      849
#define LC2G3D1N                      850
#define CLC2GLS2_D1N                  851
#define CLC2GLS2_D1T                  852
#define LC2G3D1T                      853
#define CLC2GLS2_D2N                  854
#define LC2G3D2N                      855
#define LC2G3D2T                      856
#define CLC2GLS2_D2T                  857
#define CLC2GLS2_D3N                  858
#define LC2G3D3N                      859
#define CLC2GLS2_D3T                  860
#define LC2G3D3T                      861
#define CLC2GLS2_D4N                  862
#define LC2G3D4N                      863
#define LC2G3D4T                      864
#define CLC2GLS2_D4T                  865
#define CLC2GLS3                      866
#define LC2G4D1N                      867
#define CLC2GLS3_G4D1N                868
#define CLC2GLS3_G4D1T                869
#define LC2G4D1T                      870
#define CLC2GLS3_G4D2N                871
#define LC2G4D2N                      872
#define LC2G4D2T                      873
#define CLC2GLS3_G4D2T                874
#define CLC2GLS3_G4D3N                875
#define LC2G4D3N                      876
#define CLC2GLS3_G4D3T                877
#define LC2G4D3T                      878
#define LC2G4D4N                      879
#define CLC2GLS3_G4D4N                880
#define CLC2GLS3_G4D4T                881
#define LC2G4D4T                      882
#define CLC3CON                       883
#define LC3MODE                       884
#define CLC3CON_LCMODE0               885
#define LC3MODE0                      886
#define CLC3CON_LCMODE1               887
#define LC3MODE1                      888
#define CLC3CON_LCMODE2               889
#define LC3MODE2                      890
#define LC3INTN                       891
#define CLC3CON_LCINTN                892
#define LC3INTP                       893
#define CLC3CON_LCINTP                894
#define CLC3CON_LCOUT                 895
#define LC3OUT                        896
#define CLC3CON_LCOE                  897
#define LC3OE                         898
#define LC3EN                         899
#define CLC3CON_LCEN                  900
#define CLC3POL                       901
#define LC3G1POL                      902
#define CLC3POL_G1POL                 903
#define LC3G2POL                      904
#define CLC3POL_G2POL                 905
#define CLC3POL_G3POL                 906
#define LC3G3POL                      907
#define LC3G4POL                      908
#define CLC3POL_G4POL                 909
#define LC3POL                        910
#define CLC3POL_POL                   911
#define CLC3SEL0                      912
#define LC3D1S0                       913
#define LC3D1S                        914
#define CLC3SEL0_D1S0                 915
#define LC3D1S1                       916
#define CLC3SEL0_D1S1                 917
#define LC3D1S2                       918
#define CLC3SEL0_D1S2                 919
#define LC3D2S                        920
#define CLC3SEL0_D2S0                 921
#define LC3D2S0                       922
#define CLC3SEL0_D2S1                 923
#define LC3D2S1                       924
#define CLC3SEL0_D2S2                 925
#define LC3D2S2                       926
#define CLC3SEL1                      927
#define LC3D3S                        928
#define CLC3SEL1_D3S0                 929
#define LC3D3S0                       930
#define CLC3SEL1_D3S1                 931
#define LC3D3S1                       932
#define CLC3SEL1_D3S2                 933
#define LC3D3S2                       934
#define LC3D4S0                       935
#define LC3D4S                        936
#define CLC3SEL1_D4S0                 937
#define LC3D4S1                       938
#define CLC3SEL1_D4S1                 939
#define LC3D4S2                       940
#define CLC3SEL1_D4S2                 941
#define CLC3GLS0                      942
#define CLC3GLS0_D1N                  943
#define LC3G1D1N                      944
#define LC3G1D1T                      945
#define CLC3GLS0_D1T                  946
#define LC3G1D2N                      947
#define CLC3GLS0_D2N                  948
#define CLC3GLS0_D2T                  949
#define LC3G1D2T                      950
#define CLC3GLS0_D3N                  951
#define LC3G1D3N                      952
#define LC3G1D3T                      953
#define CLC3GLS0_D3T                  954
#define CLC3GLS0_D4N                  955
#define LC3G1D4N                      956
#define CLC3GLS0_D4T                  957
#define LC3G1D4T                      958
#define CLC3GLS1                      959
#define LC3G2D1N                      960
#define CLC3GLS1_D1N                  961
#define CLC3GLS1_D1T                  962
#define LC3G2D1T                      963
#define LC3G2D2N                      964
#define CLC3GLS1_D2N                  965
#define LC3G2D2T                      966
#define CLC3GLS1_D2T                  967
#define LC3G2D3N                      968
#define CLC3GLS1_D3N                  969
#define CLC3GLS1_D3T                  970
#define LC3G2D3T                      971
#define LC3G2D4N                      972
#define CLC3GLS1_D4N                  973
#define LC3G2D4T                      974
#define CLC3GLS1_D4T                  975
#define CLC3GLS2                      976
#define LC3G3D1N                      977
#define CLC3GLS2_D1N                  978
#define LC3G3D1T                      979
#define CLC3GLS2_D1T                  980
#define CLC3GLS2_D2N                  981
#define LC3G3D2N                      982
#define CLC3GLS2_D2T                  983
#define LC3G3D2T                      984
#define CLC3GLS2_D3N                  985
#define LC3G3D3N                      986
#define LC3G3D3T                      987
#define CLC3GLS2_D3T                  988
#define CLC3GLS2_D4N                  989
#define LC3G3D4N                      990
#define CLC3GLS2_D4T                  991
#define LC3G3D4T                      992
#define CLC3GLS3                      993
#define LC3G4D1N                      994
#define CLC3GLS3_G4D1N                995
#define LC3G4D1T                      996
#define CLC3GLS3_G4D1T                997
#define LC3G4D2N                      998
#define CLC3GLS3_G4D2N                999
#define CLC3GLS3_G4D2T                1000
#define LC3G4D2T                      1001
#define LC3G4D3N                      1002
#define CLC3GLS3_G4D3N                1003
#define CLC3GLS3_G4D3T                1004
#define LC3G4D3T                      1005
#define LC3G4D4N                      1006
#define CLC3GLS3_G4D4N                1007
#define LC3G4D4T                      1008
#define CLC3GLS3_G4D4T                1009
#define CLC4CON                       1010
#define LC4MODE                       1011
#define LC4MODE0                      1012
#define CLC4CON_LCMODE0               1013
#define CLC4CON_LCMODE1               1014
#define LC4MODE1                      1015
#define LC4MODE2                      1016
#define CLC4CON_LCMODE2               1017
#define CLC4CON_LCINTN                1018
#define LC4INTN                       1019
#define CLC4CON_LCINTP                1020
#define LC4INTP                       1021
#define LC4OUT                        1022
#define CLC4CON_LCOUT                 1023
#define CLC4CON_LCOE                  1024
#define LC4OE                         1025
#define CLC4CON_LCEN                  1026
#define LC4EN                         1027
#define CLC4POL                       1028
#define CLC4POL_G1POL                 1029
#define LC4G1POL                      1030
#define CLC4POL_G2POL                 1031
#define LC4G2POL                      1032
#define CLC4POL_G3POL                 1033
#define LC4G3POL                      1034
#define LC4G4POL                      1035
#define CLC4POL_G4POL                 1036
#define LC4POL                        1037
#define CLC4POL_POL                   1038
#define CLC4SEL0                      1039
#define CLC4SEL0_D1S0                 1040
#define LC4D1S0                       1041
#define LC4D1S                        1042
#define CLC4SEL0_D1S1                 1043
#define LC4D1S1                       1044
#define CLC4SEL0_D1S2                 1045
#define LC4D1S2                       1046
#define LC4D2S                        1047
#define LC4D2S0                       1048
#define CLC4SEL0_D2S0                 1049
#define LC4D2S1                       1050
#define CLC4SEL0_D2S1                 1051
#define LC4D2S2                       1052
#define CLC4SEL0_D2S2                 1053
#define CLC4SEL1                      1054
#define LC4D3S                        1055
#define CLC4SEL1_D3S0                 1056
#define LC4D3S0                       1057
#define CLC4SEL1_D3S1                 1058
#define LC4D3S1                       1059
#define CLC4SEL1_D3S2                 1060
#define LC4D3S2                       1061
#define LC4D4S                        1062
#define LC4D4S0                       1063
#define CLC4SEL1_D4S0                 1064
#define LC4D4S1                       1065
#define CLC4SEL1_D4S1                 1066
#define LC4D4S2                       1067
#define CLC4SEL1_D4S2                 1068
#define CLC4GLS0                      1069
#define CLC4GLS0_D1N                  1070
#define LC4G1D1N                      1071
#define CLC4GLS0_D1T                  1072
#define LC4G1D1T                      1073
#define CLC4GLS0_D2N                  1074
#define LC4G1D2N                      1075
#define CLC4GLS0_D2T                  1076
#define LC4G1D2T                      1077
#define CLC4GLS0_D3N                  1078
#define LC4G1D3N                      1079
#define CLC4GLS0_D3T                  1080
#define LC4G1D3T                      1081
#define CLC4GLS0_D4N                  1082
#define LC4G1D4N                      1083
#define CLC4GLS0_D4T                  1084
#define LC4G1D4T                      1085
#define CLC4GLS1                      1086
#define CLC4GLS1_D1N                  1087
#define LC4G2D1N                      1088
#define CLC4GLS1_D1T                  1089
#define LC4G2D1T                      1090
